darien/old/stentor_09_09_09/app/controllers/business_card_batches_controller.rb

  def index
    @business_card_batches = BusinessCardBatch.all
---
SELECT * FROM "business_card_batches"