darien/old/stentor_09_09_11/app/controllers/business_card_orders_controller.rb

SELECT * FROM "business_card_orders" WHERE ("business_card_orders"."id" = 1)
---
  def show
    @business_card_order = BusinessCardOrder.find(params[:id])

INSERT INTO "business_card_orders" ("business_card_id", "updated_at", "quantity", "reprint", "business_card_batch_id", "created_at") VALUES(53, '2009-09-10 20:49:56', 50, 'f', NULL, '2009-09-10 20:49:56')
---
  def create
    @business_card_order = BusinessCardOrder.new(params[:business_card_order])
    if @business_card_order.save

SELECT * FROM "business_card_orders" WHERE ("business_card_orders"."id" = 2)
---
  def edit
    @business_card_order = BusinessCardOrder.find(params[:id])

SELECT * FROM "business_card_orders" WHERE ("business_card_orders"."id" = 2)
UPDATE "business_card_orders" SET "updated_at" = '2009-09-10 21:50:53', "quantity" = 2 WHERE "id" = 2
---
  def update
    @business_card_order = BusinessCardOrder.find(params[:id])
    if @business_card_order.update_attributes(params[:business_card_order])

SELECT * FROM "business_card_orders" WHERE ("business_card_orders"."id" = 2)
DELETE FROM "business_card_orders" WHERE "id" = 2
---
  def destroy
    @business_card_order = BusinessCardOrder.find(params[:id])
    @business_card_order.destroy