darien/old/stentor_09_09_11/app/controllers/business_cards_controller.rb

  def index

    respond_to do |format|
      format.html do
        @business_cards = BusinessCard.find(:all, :order => "ordered ASC")
      end # index.html
      format.xml do
         @business_cards = BusinessCard.all
---
SELECT * FROM "business_cards" WHERE (name LIKE '%{params[:search]}%')
SELECT * FROM "business_cards" ORDER BY ordered DESC

  def show
    @business_card = BusinessCard.find(params[:id])
---
SELECT * FROM "business_cards" WHERE ("business_cards"."id" = 1)

  def create
    @business_card = BusinessCard.new(params[:business_card])
    if @business_card.save
---
INSERT INTO "business_cards" ("name", "school_line_2", "city", "zip", "altEd", "updated_at", "title", "title_line_2", "phone", "fax", "distinguished_school", "school", "address", "extra", "state", "email", "created_at") VALUES('Rosalinda Pineda', 'Gilbert High School - West', 'Anaheim', '92806-4999', 'f', '2009-09-10 02:54:53', 'Counselor', '', '714-999-3644', '714-535-3991', 'f', 'Katella High School', '2200 East Wagner Avenue', 'Linea de Español 714-999-3650', 'CA', 'pineda_r@auhsd.us', '2009-09-10 02:54:53')

  def edit
    @business_card = BusinessCard.find(params[:id])
---
SELECT * FROM "business_cards" WHERE ("business_cards"."id" = 7)

  def update
    @business_card = BusinessCard.find(params[:id])
    if @business_card.update_attributes(params[:business_card])
---
SELECT * FROM "business_cards" WHERE ("business_cards"."id" = 7)
UPDATE "business_cards" SET "fax" = '714-994-5434', "phone" = '714-220-4854', "school_line_2" = 'Gilbert High School - West', "email" = 'malotte_n@auhsd.us', "zip" = '90620', "city" = 'Buena Park', "state" = 'CA', "address" = '6855 La Palma Avenue', "updated_at" = '2009-09-10 02:40:51', "altEd" = 't' WHERE "id" = 9