darien/old/stentor_09_09_11/app/controllers/business_card_batches_controller.rb

SELECT * FROM "business_card_batches"
---
  def index
    @business_card_batches = BusinessCardBatch.all

SELECT * FROM "business_card_orders" WHERE ("business_card_orders"."business_card_batch_id" IS NULL) ORDER BY quantity ASC LIMIT 1
---
  def new
    cards_up = 20
    @business_card_batch = BusinessCardBatch.new
    @business_card_batch.quantity = (BusinessCardOrder.not_completed.fewest_cards(1)).collect{ |t| t.quantity }.first