darien/old/pontoon/app/controllers/inquiries_controller.rb

SELECT * FROM "inquiries"
---
  def index
    @inquiries = Inquiry.all