darien/old/pontoon/app/controllers/person_phones_controller.rb

SELECT * FROM "person_phones"
---
  def index
    @person_phones = PersonPhone.all

SELECT * FROM "person_phones" WHERE ("person_phones"."id" = 1)
---
  def show
    @person_phone = PersonPhone.find(params[:id])

SELECT * FROM "person_phones" WHERE ("person_phones"."id" = 1)
---
  def edit
    @person_phone = PersonPhone.find(params[:id])

INSERT INTO "person_phones" ("updated_at", "phone", "person", "created_at") VALUES('2009-07-21 20:23:05', 0, 0, '2009-07-21 20:23:05')
---
  def create
    @person_phone = PersonPhone.new(params[:person_phone])

    respond_to do |format|
      if @person_phone.save

SELECT * FROM "person_phones" WHERE ("person_phones"."id" = 1)
UPDATE "person_phones" SET "person" = 1, "phone" = 1, "updated_at" = '2009-07-21 21:00:07' WHERE "id" = 1
---
  def update
    @person_phone = PersonPhone.find(params[:id])

    respond_to do |format|
      if @person_phone.update_attributes(params[:person_phone])