darien/old/pontoon/app/controllers/phone_types_controller.rb

  def index
    @phone_types = PhoneType.all
---
SELECT * FROM "phone_types"

  def show
    @phone_type = PhoneType.find(params[:id])
---
SELECT * FROM "phone_types" WHERE ("phone_types"."id" = 1)

  def create
    @phone_type = PhoneType.new(params[:phone_type])

    respond_to do |format|
      if @phone_type.save
---
INSERT INTO "phone_types" ("phone_type", "updated_at", "created_at") VALUES('Office', '2009-07-21 20:21:39', '2009-07-21 20:21:39')