darien/old/quiver/app/controllers/persiphones_controller.rb

SELECT * FROM "persiphones"
---
  def index
    @persiphones = Persiphone.all

SELECT * FROM "persiphones" WHERE ("persiphones"."id" = 1)
SELECT * FROM "phones" WHERE ("phones"."id" = 1)
---
  def show
    @persiphone = Persiphone.find(params[:id])

SELECT * FROM "persiphones" WHERE ("persiphones"."id" = 1)
---
  def edit
    @persiphone = Persiphone.find(params[:id])

INSERT INTO "persiphones" ("updated_at", "phone_id", "phone", "person_id", "created_at") VALUES('2009-07-23 22:39:51', 2, NULL, 1, '2009-07-23 22:39:51')
---
  def create
    @persiphone = Persiphone.new(params[:persiphone])

    respond_to do |format|
      if @persiphone.save

SELECT * FROM "persiphones" WHERE ("persiphones"."id" = 1)
UPDATE "persiphones" SET "person_id" = 1, "phone_id" = 1, "updated_at" = '2009-07-23 22:35:57' WHERE "id" = 1
---
  def update
    @persiphone = Persiphone.find(params[:id])

    respond_to do |format|
      if @persiphone.update_attributes(params[:persiphone])