darien/old/quiver/app/controllers/phones_controller.rb

SELECT * FROM "phones"
---
  def index
    @phones = Phone.all

SELECT * FROM "phones" WHERE ("phones"."id" = 1)
---
  def show
    @phone = Phone.find(params[:id])

SELECT * FROM "phones" WHERE ("phones"."id" = 1)
---
  def edit
    @phone = Phone.find(params[:id])

INSERT INTO "phones" ("updated_at", "phone_area_code", "phone_number", "phone_type_id", "created_at") VALUES('2009-07-23 21:14:20', '714', '999-3578', NULL, '2009-07-23 21:14:20')
---
  def create
    @phone = Phone.new(params[:phone])

    respond_to do |format|
      if @phone.save

SELECT * FROM "phones" WHERE ("phones"."id" = 1)
UPDATE "phones" SET "updated_at" = '2009-07-23 21:15:29', "phone_type_id" = 1 WHERE "id" = 1
---
  def update
    @phone = Phone.find(params[:id])

    respond_to do |format|
      if @phone.update_attributes(params[:phone])