cocoaJukebox/branches/cocoafrontend/app/controllers/albums_controller.rb

SELECT "songs".* FROM "songs" WHERE ("songs".album_id = 3491)
SELECT * FROM "albums" WHERE ("albums"."id" = 3491)
SELECT * FROM "artists" WHERE ("artists"."id" = 505)
SELECT * FROM "genres" WHERE ("genres"."id" = 3)
---
  def show
    @album = Album.find(params[:id], :include => [:artists, :genre, :songs])