cocoaJukebox/branches/cocoafrontend/app/controllers/playlists_controller.rb

SELECT * FROM "playlists"
---
  def index
    playlists = Playlist.all :include=> :user