uva/trunk/app/controllers/accounts_controller.rb

SELECT * FROM "accounts"
---
  def index
    @accounts = Account.all