uva/trunk/app/controllers/departments_controller.rb

  def index
    @departments = Department.all
---
SELECT * FROM "departments"

  def show
    @department = Department.find(params[:id])
---
SELECT * FROM "departments" WHERE ("departments"."id" = 75)

  def destroy
    @department = Department.find(params[:id])
    @department.destroy
---
SELECT * FROM "departments" WHERE ("departments"."id" = 74)
DELETE FROM "departments" WHERE "id" = 74