uva/trunk/app/controllers/jobs_controller.rb

  def show
    @job = Job.find(params[:id])
    @workflows = Workflow.find(:all, :conditions => ['job_id = ?', @job.id]).sort_by{ |m| m.order }
---
SELECT * FROM "workflows" WHERE (job_id = 36)

  def create
    depart = params[:job][:dept]
    acnt = params[:job][:acct]
    @job = Job.new(params[:job])


    if depart == ( "" || nil )  then
      @job.department_id = nil
    elsif Department.find_by_name(depart).nil?
      dept = Department.new
      dept.name = depart.upcase
      dept.save
---
SELECT * FROM "departments" WHERE ("departments"."name" = '--- :department_name
INSERT INTO "departments" ("name", "created_at", "updated_at") VALUES('Make dept', '2009-11-12 12:28:28', '2009-11-12 12:28:28')