uva/trunk/app/controllers/workflows_controller.rb

  def index
    @workflows = Workflow.all
---
SELECT * FROM "workflows"

  def show
    @workflow = Workflow.find(params[:id])
---
SELECT * FROM "workflows" WHERE ("workflows"."id" = 50)

  def create
    @workflow = Workflow.new(params[:workflow])
    if @workflow.save
---
INSERT INTO "workflows" ("name", "created_at", "completed", "completed_date", "updated_at", "note", "job_id") VALUES('Design', '2009-11-11 15:47:21', 'f', '2009-11-14 00:00:00', '2009-11-11 15:47:21', 'Dan Henderson', NULL)

  def edit
    @workflow = Workflow.find(params[:id])
---
SELECT * FROM "workflows" WHERE ("workflows"."id" = 50)

  def update
    @workflow = Workflow.find(params[:id])
    if @workflow.update_attributes(params[:workflow])
---
SELECT * FROM "workflows" WHERE ("workflows"."id" = 50)
UPDATE "workflows" SET "updated_at" = '2009-11-11 15:47:34', "created_at" = '2009-11-11 15:47:21', "name" = 'Design', "job_id" = NULL, "note" = 'Dan Henderson', "completed" = 't', "completed_date" = '2009-11-14 00:00:00' WHERE "id" = 50

  def destroy
    @workflow = Workflow.find(params[:id])
    @workflow.destroy
---
SELECT * FROM "workflows" WHERE ("workflows"."id" = 1)
DELETE FROM "workflows" WHERE "id" = 1